app/controllers/api/v1/employees_controller.rb

SELECT  "tenants".* FROM "tenants" WHERE "tenants"."id" = $1 LIMIT $2  [["id", "d920d1ff-6036-4942-87f2-207390f454c0"], ["LIMIT", 1]]
---
      def index
        tenant = Tenant.find(@tenant)